wk20_hw/dating_app/dating_app_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render(json: { users: User.all })

INSERT INTO "users" ("name", "starsign", "img", "ltl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
def create
    user = User.new(user_params)

    if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "John Wayne"], ["updated_at", "2020-05-12 16:22:37.155309"], ["id", 5]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
---
  def destroy
    user = User.destroy(params[:id])