wk20_hw/tweeter_app_api/app/controllers/tweets_controller.rb

	def create
		tweet = Tweet.new(tweet_params)

		if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Crentist"], ["content", "My dentist's name is Crentist, maybe that's why he became a dentist."], ["author", "Dwight"]]

	def update
		tweet = Tweet.find(params[:id])
		tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1, "content" = $2, "author" = $3 WHERE "tweets"."id" = $4  [["title", "Updated Tweet"], ["content", "My update route works"], ["author", "Dan"], ["id", 2]]